In [1]:
import numpy as np
import pandas as pd

## Wczytanie plików

In [ ]:
## wczytaj plik data/movies.dat
## sep ": :"
## engine ustaw jako python
## kodowanie cp1252 -- ## ! pokazać kododwania
## header None
## pokaż tylko kolumny "MovieID", "Title", "Genres"

In [87]:
movies = pd.read_csv("data/movies.dat", sep="::", engine="python", encoding='cp1252', header=None) #, names=["MovieID", "Title", "Genres"])
movies.columns = ["MovieID", "Title", "Genres"]
movies

,MovieID,Title,Genres
0,1,Toy Story (1995),Animation|Children's|Comedy
1,2,Jumanji (1995),Adventure|Children's|Fantasy
2,3,Grumpier Old Men (1995),Comedy|Romance
3,4,Waiting to Exhale (1995),Comedy|Drama
4,5,Father of the Bride Part II (1995),Comedy
...,...,...,...
3878,3948,Meet the Parents (2000),Comedy
3879,3949,Requiem for a Dream (2000),Drama
3880,3950,Tigerland (2000),Drama
3881,3951,Two Family House (2000),Drama
3882,3952,"Contender, The (2000)",Drama|Thriller

In [ ]:
## wczytaj plik data/users.dat
## sep ": :"
## engine ustaw jako python
## header None
## pokaż tylko kolumny "UserID", "Gender", "Age", "Occupation", "Zip-code"

In [88]:
users = pd.read_csv("data/users.dat", sep="::", engine="python", header=None) #, names=["MovieID", "Title", "Genres"])
users.columns = ["UserID", "Gender", "Age", "Occupation", "Zip-code"]

In [ ]:
## wczytaj plik data/ratings.dat
## sep ": :"
## engine ustaw jako python
## header None
## pokaż tylko kolumny "UserID", "Gender", "Age", "Occupation", "Zip-code"

In [89]:
ratings = pd.read_csv("data/ratings.dat", sep="::", engine="python", header=None) #, names=["MovieID", "Title", "Genres"])
ratings.columns = ["UserID", "MovieID", "Rating", "Timestamp"]
ratings.head()

   UserID  MovieID Rating    Timestamp
0       1     1193      5  978300760.0
1       1      661      3  978302109.0
2       1      914      3  978301968.0
3       1     3408      4  978300275.0
4       1     2355      5  978824291.0

## Rok produkcji

In [ ]:
## wytnij rok produkcji - 4 cyfry za pomoca funkcje str i zakresu

In [91]:
movies.Title.str[-5:-1]

0       1995
1       1995
2       1995
3       1995
4       1995
        ...
3878    2000
3879    2000
3880    2000
3881    2000
3882    2000
Name: Title, Length: 3883, dtype: object

In [ ]:
## wytnij rok produkcji - 4 cyfry za pomoca funkcje str.slice z argumentami start i stop
## przypisz do kolumny 'Year'

In [92]:
movies["Year"] = movies.Title.str.slice(start=-5, stop=-1).astype("int")
movies.head()

,MovieID,Title,Genres,Year
0,1,Toy Story (1995),Animation|Children's|Comedy,1995
1,2,Jumanji (1995),Adventure|Children's|Fantasy,1995
2,3,Grumpier Old Men (1995),Comedy|Romance,1995
3,4,Waiting to Exhale (1995),Comedy|Drama,1995
4,5,Father of the Bride Part II (1995),Comedy,1995

In [ ]:
## pokaze typy kolumn

In [93]:
movies.dtypes

MovieID     int64
Title      object
Genres     object
Year        int32
dtype: object

In [ ]:
## wytnij regexem r"\((\d{4})\)" wartość  za pomoca funkcji str.extrract i zmien astype na int

In [8]:
movies.Title.str.extract(r"\((\d{4})\)", expand=False).astype("int")

0       1995
1       1995
2       1995
3       1995
4       1995
        ...
3878    2000
3879    2000
3880    2000
3881    2000
3882    2000
Name: Title, Length: 3883, dtype: int32

## liczba filmów łącznie

In [ ]:
## ile jest filmów łacznie

In [9]:
len(movies)

3883

In [10]:
movies.shape[0]

3883

In [11]:
int(movies.describe().loc["count"][0])

3883

In [12]:
movies.count()[0]

3883

In [13]:
np.unique(movies.Title.values).shape

(3883,)

In [14]:
len(movies.Title.unique())

3883

## ile filmów powstało w poszczególnych latach

In [15]:
movies.groupby("Year").MovieID.count()

Year
1919      3
1920      2
1921      1
1922      2
1923      3
       ...
1996    345
1997    315
1998    337
1999    283
2000    156
Name: MovieID, Length: 81, dtype: int64

In [34]:
movies.groupby("Year").count()["MovieID"]

Year
1919      3
1920      2
1921      1
1922      2
1923      3
       ...
1996    345
1997    315
1998    337
1999    283
2000    156
Name: MovieID, Length: 81, dtype: int64

## rozkład płci i grup wiekowych

In [17]:
users.groupby("Gender").UserID.count()

Gender
F    1709
M    4331
Name: UserID, dtype: int64

In [18]:
users["Gender"].value_counts()

M    4331
F    1709
Name: Gender, dtype: int64

In [19]:
users.groupby("Age").UserID.count()

Age
1      222
18    1103
25    2096
35    1193
45     550
50     496
56     380
Name: UserID, dtype: int64

In [20]:
users["Age"].value_counts()

25    2096
35    1193
18    1103
45     550
50     496
56     380
1      222
Name: Age, dtype: int64

In [21]:
users.groupby(["Gender","Age"]).UserID.count()

Gender  Age
F       1        78
        18      298
        25      558
        35      338
        45      189
        50      146
        56      102
M       1       144
        18      805
        25     1538
        35      855
        45      361
        50      350
        56      278
Name: UserID, dtype: int64

In [22]:
pd.crosstab(users.Gender, users.Age)

Age      1    18    25   35   45   50   56
Gender
F        78  298   558  338  189  146  102
M       144  805  1538  855  361  350  278

In [23]:
pd.crosstab(users.Age, users.Gender)

Gender    F     M
Age
1        78   144
18      298   805
25      558  1538
35      338   855
45      189   361
50      146   350
56      102   278

## jaki gatunek filmowy jest najczęstszy

In [24]:
np.concatenate((np.array([1,2,3]), np.array([4,5,6])))

array([1, 2, 3, 4, 5, 6])

In [25]:
np.concatenate([[[1,2],[1,2]],[[5,5],[5,6]]],axis=1)

array([[1, 2, 5, 5],
       [1, 2, 5, 6]])

In [26]:
# movies.Genres
gatunkiZliczenia = np.unique(np.concatenate(movies.Genres.str.split("|")), return_counts=True)

In [27]:
pd.DataFrame({"Genre":gatunkiZliczenia[0],"Count":gatunkiZliczenia[1]}).sort_values(by="Count", ascending=False)

          Genre  Count
7         Drama   1603
4        Comedy   1200
0        Action    503
15     Thriller    492
13      Romance    471
10       Horror    343
1     Adventure    283
14       Sci-Fi    276
3    Children's    251
5         Crime    211
16          War    143
6   Documentary    127
11      Musical    114
12      Mystery    106
2     Animation    105
17      Western     68
8       Fantasy     68
9     Film-Noir     44

In [28]:
pd.Series(np.concatenate(movies.Genres.str.split("|"))).value_counts()

Drama          1603
Comedy         1200
Action          503
Thriller        492
Romance         471
Horror          343
Adventure       283
Sci-Fi          276
Children's      251
Crime           211
War             143
Documentary     127
Musical         114
Mystery         106
Animation       105
Fantasy          68
Western          68
Film-Noir        44
dtype: int64

In [29]:
gatunki = np.concatenate(movies.Genres.str.split("|"))
gatunkiRamka = pd.DataFrame({"Gatunek": gatunki, "Sztuczna":np.repeat(1, len(gatunki))})
# gatunkiRamka = pd.DataFrame({"Gatunek": gatunki})
gatunkiRamka.groupby("Gatunek").count()

             Sztuczna
Gatunek
Action            503
Adventure         283
Animation         105
Children's        251
Comedy           1200
Crime             211
Documentary       127
Drama            1603
Fantasy            68
Film-Noir          44
Horror            343
Musical           114
Mystery           106
Romance           471
Sci-Fi            276
Thriller          492
War               143
Western            68

## Film wszechczasów (bez odrzucania)

In [30]:
ocenySrednie = ratings[["MovieID", "Rating"]].groupby("MovieID").mean().reset_index()
# ocenySrednie[ocenySrednie.Rating > 4.9] ## problem !

C:\Users\pawel\AppData\Local\Temp\ipykernel_34020\1221883180.py:1: FutureWarning: Dropping invalid columns in DataFrameGroupBy.mean is deprecated. In a future version, a TypeError will be raised. Before calling .mean, select only columns which should be valid for the function.
  ocenySrednie = ratings[["MovieID", "Rating"]].groupby("MovieID").mean().reset_index()

In [44]:
ratings[['MovieID','Rating']].info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 684380 entries, 0 to 684379
Data columns (total 2 columns):
 #   Column   Non-Null Count   Dtype
---  ------   --------------   -----
 0   MovieID  684380 non-null  int64
 1   Rating   684380 non-null  object
dtypes: int64(1), object(1)
memory usage: 10.4+ MB

In [52]:
ratings['Rating'][0:-1]

0         5
1         3
2         3
3         4
4         5
         ..
684374    2
684375    3
684376    5
684377    3
684378    5
Name: Rating, Length: 684379, dtype: object

In [53]:
ocenySrednie = ratings[["MovieID", "Rating"]][0:-1].groupby("MovieID").mean().reset_index()

In [67]:
ratings[0:-1]['Rating'].unique()

array(['5', '3', '4', '2', '1'], dtype=object)

In [69]:
ratings = ratings[0:-1]

In [72]:
ratings['Rating'] = ratings['Rating'].astype(int)

C:\Users\pawel\AppData\Local\Temp\ipykernel_34020\2677571412.py:1: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  ratings['Rating'] = ratings['Rating'].astype(int)

In [80]:
ocenySrednie = ratings[["MovieID", "Rating"]].groupby("MovieID").mean()

In [81]:
pd.merge(ocenySrednie, movies, on="MovieID").sort_values(by="Rating", ascending=False).reset_index().drop("index", axis=1)

,MovieID,Rating,Title,Genres,Year
0,853,5.0,Dingo (1992),Drama,1992
1,3280,5.0,"Baby, The (1973)",Horror,1973
2,3236,5.0,Zachariah (1971),Western,1971
3,2444,5.0,24 7: Twenty Four Seven (1997),Comedy|Drama,1997
4,981,5.0,Dangerous Ground (1997),Drama,1997
...,...,...,...,...,...
3649,690,1.0,"Promise, The (Versprechen, Das) (1994)",Romance,1994
3650,3904,1.0,"Uninvited Guest, An (2000)",Drama,2000
3651,730,1.0,"Low Life, The (1994)",Drama,1994
3652,1165,1.0,"Bloody Child, The (1996)",Drama|Thriller,1996
3653,895,1.0,Venice/Venice (1992),Drama,1992

## film wszechczasów (z odrzucaniem)

In [82]:
#tutaj trzeba by bylo potem left joina (left merge):
licznosci = ratings[["MovieID","Rating"]].groupby("MovieID").count().reset_index()
licznosci.columns = ["MovieID", "LiczbaGlosow"]
licznosci = licznosci[licznosci.LiczbaGlosow > 100]

#od nowa, lepiej:
srednieZliczenia = ratings[["MovieID","Rating"]].groupby("MovieID").agg(["mean","count"])
srednieZliczenia = srednieZliczenia[srednieZliczenia["Rating","count"] > 100]

srednieZliczenia = srednieZliczenia.reset_index()
srednieZliczenia.columns = ["MovieID","mean", "count"]
srednieZliczenia
#right tylko zeby pokazac, ze niektore filmy nie maja swojej pary, bo maja za malo glosow
#lepiej dac left albo inner
pd.merge(srednieZliczenia, movies, on="MovieID", how="right").sort_values(by="mean", ascending=False).reset_index().drop("index", axis=1)
#licznosci.sort_values(by="LiczbaGlosow")

,MovieID,mean,count,Title,Genres,Year
0,2019,4.552972,387.0,Seven Samurai (The Magnificent Seven) (Shichin...,Action|Drama,1954
1,318,4.552159,1505.0,"Shawshank Redemption, The (1994)",Drama,1994
2,50,4.525589,1231.0,"Usual Suspects, The (1995)",Crime|Thriller,1995
3,858,4.520192,1461.0,"Godfather, The (1972)",Action|Crime|Drama,1972
4,1198,4.511628,1677.0,Raiders of the Lost Ark (1981),Action|Adventure,1981
...,...,...,...,...,...,...
3878,3945,NaN,NaN,Digimon: The Movie (2000),Adventure|Animation|Children's,2000
3879,3946,NaN,NaN,Get Carter (2000),Action|Drama|Thriller,2000
3880,3947,NaN,NaN,Get Carter (1971),Thriller,1971
3881,3950,NaN,NaN,Tigerland (2000),Drama,2000
3882,3951,NaN,NaN,Two Family House (2000),Drama,2000

## najlepsze filmy wg mezczyzn i wg kobiet

In [83]:
ratingGender = pd.merge(ratings, users, on="UserID")[["UserID", "MovieID", "Rating" ,"Gender"]]
mezczyzni = ratingGender[ratingGender.Gender == "M"]
kobiety = ratingGender[ratingGender.Gender == "F"]

In [84]:
#od nowa, lepiej:
srednieZliczenia = mezczyzni[["MovieID","Rating"]].groupby("MovieID").agg(["mean","count"])
srednieZliczenia = srednieZliczenia[srednieZliczenia["Rating","count"] > 100]

srednieZliczenia = srednieZliczenia.reset_index()
srednieZliczenia.columns = ["MovieID","mean", "count"]
srednieZliczenia
#right tylko zeby pokazac, ze niektore filmy nie maja swojej pary, bo maja za malo glosow
#lepiej dac left albo inner
pd.merge(srednieZliczenia, movies, on="MovieID", how="right").sort_values(by="mean", ascending=False).reset_index().drop("index", axis=1)

,MovieID,mean,count,Title,Genres,Year
0,858,4.575472,1166.0,"Godfather, The (1972)",Action|Crime|Drama,1972
1,2019,4.569277,332.0,Seven Samurai (The Magnificent Seven) (Shichin...,Action|Drama,1954
2,318,4.556859,1108.0,"Shawshank Redemption, The (1994)",Drama,1994
3,1178,4.551181,127.0,Paths of Glory (1957),Drama|War,1957
4,1198,4.550411,1339.0,Raiders of the Lost Ark (1981),Action|Adventure,1981
...,...,...,...,...,...,...
3878,3945,NaN,NaN,Digimon: The Movie (2000),Adventure|Animation|Children's,2000
3879,3946,NaN,NaN,Get Carter (2000),Action|Drama|Thriller,2000
3880,3947,NaN,NaN,Get Carter (1971),Thriller,1971
3881,3950,NaN,NaN,Tigerland (2000),Drama,2000
3882,3951,NaN,NaN,Two Family House (2000),Drama,2000

In [ ]:
#od nowa, lepiej:
srednieZliczenia = kobiety[["MovieID","Rating"]].groupby("MovieID").agg(["mean","count"])
srednieZliczenia = srednieZliczenia[srednieZliczenia["Rating","count"] > 100]

srednieZliczenia = srednieZliczenia.reset_index()
srednieZliczenia.columns = ["MovieID","mean", "count"]
srednieZliczenia
#right tylko zeby pokazac, ze niektore filmy nie maja swojej pary, bo maja za malo glosow
#lepiej dac left albo inner
pd.merge(srednieZliczenia, movies, on="MovieID", how="right").sort_values(by="mean", ascending=False).reset_index().drop("index", axis=1)

In [ ]:
ratingGender = pd.merge(ratings, users, on="UserID")[["MovieID", "Rating" ,"Gender"]]
ratingGender = ratingGender.groupby(["Gender", "MovieID"]).agg(["mean","count"]).reset_index()
ratingGender.columns = ["Gender", "MovieID", "Mean", "Count"]
ratingGender = ratingGender[ratingGender.Count > 100]
# ratingGender
wszystko = pd.merge(ratingGender, movies, on="MovieID").sort_values(by=["Mean","Gender"], ascending=False).reset_index().drop("index", axis=1)
wszystko.drop_duplicates(["Gender"])

## Średni rok w grupach wiekowych

In [85]:
result_user_movie = pd.merge(movies, ratings, on="MovieID")
result_user_movie = pd.merge(result_user_movie, users, on="UserID")
result_user_movie

,MovieID,Title,Genres,Year,UserID,Rating,Timestamp,Gender,Age,Occupation,Zip-code
0,1,Toy Story (1995),Animation|Children's|Comedy,1995,1,5,978824268.0,F,1,10,48067
1,48,Pocahontas (1995),Animation|Children's|Musical|Romance,1995,1,5,978824351.0,F,1,10,48067
2,150,Apollo 13 (1995),Drama,1995,1,5,978301777.0,F,1,10,48067
3,260,Star Wars: Episode IV - A New Hope (1977),Action|Adventure|Fantasy|Sci-Fi,1977,1,4,978300760.0,F,1,10,48067
4,527,Schindler's List (1993),Drama|War,1993,1,5,978824195.0,F,1,10,48067
...,...,...,...,...,...,...,...,...,...,...,...
684374,3536,Keeping the Faith (2000),Comedy|Romance,2000,768,4,975447360.0,M,25,12,17067
684375,3624,Shanghai Noon (2000),Action,2000,768,5,975445957.0,M,25,12,17067
684376,3755,"Perfect Storm, The (2000)",Action|Adventure|Thriller,2000,768,3,975445981.0,M,25,12,17067
684377,3896,"Way of the Gun, The (2000)",Crime|Thriller,2000,768,5,975446650.0,M,25,12,17067
684378,3911,Best in Show (2000),Comedy,2000,768,3,976552221.0,M,25,12,17067

In [86]:
result_user_movie = pd.merge(movies, ratings, on="MovieID")
result_user_movie = pd.merge(result_user_movie, users, on="UserID")
result_user_movie[["Age","Year"]].groupby(["Age"]).mean()

            Year
Age
1    1989.525477
18   1989.996011
25   1988.223616
35   1985.072545
45   1983.735667
50   1982.585758
56   1982.488802